#### Terraform Format and Style `success`
#### Terraform Initialization `success`
#### Terraform Validation `success`
#### Terraform Plan `success`

<details><summary>Show Plan</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.backend_api.github_repository.repo will be created
  + resource "github_repository" "repo" {
      + allow_auto_merge            = false
      + allow_merge_commit          = true
      + allow_rebase_merge          = true
      + allow_squash_merge          = true
      + archived                    = false
      + auto_init                   = true
      + default_branch              = (known after apply)
      + delete_branch_on_merge      = false
      + description                 = "Backend API repository"
      + etag                        = (known after apply)
      + full_name                   = (known after apply)
      + git_clone_url               = (known after apply)
      + html_url                    = (known after apply)
      + http_clone_url              = (known after apply)
      + id                          = (known after apply)
      + merge_commit_message        = "PR_TITLE"
      + merge_commit_title          = "MERGE_MESSAGE"
      + name                        = "backend-api"
      + node_id                     = (known after apply)
      + primary_language            = (known after apply)
      + private                     = (known after apply)
      + repo_id                     = (known after apply)
      + squash_merge_commit_message = "COMMIT_MESSAGES"
      + squash_merge_commit_title   = "COMMIT_OR_PR_TITLE"
      + ssh_clone_url               = (known after apply)
      + svn_url                     = (known after apply)
      + topics                      = (known after apply)
      + visibility                  = "public"
      + web_commit_signoff_required = false

      + security_and_analysis (known after apply)
    }

  # module.backend_api.github_repository_file.gitignore will be created
  + resource "github_repository_file" "gitignore" {
      + autocreate_branch_source_sha = (known after apply)
      + commit_author                = "Terraform"
      + commit_email                 = "terraform@example.com"
      + commit_message               = "Add .gitignore via Terraform"
      + commit_sha                   = (known after apply)
      + content                      = <<-EOT
            # Terraform
            *.tfstate
            *.tfstate.*
            .terraform/
            .terraform.lock.hcl
            
            # IDE
            .vscode/
            .idea/
            *.swp
            *.swo
            
            # OS
            .DS_Store
            Thumbs.db
            
            # Logs
            *.log
            logs/
            
            # Dependencies
            node_modules/
            vendor/
            
            # Environment files
            .env
            .env.local
            .env.*.local
        EOT
      + file                         = ".gitignore"
      + id                           = (known after apply)
      + overwrite_on_create          = true
      + ref                          = (known after apply)
      + repository                   = "backend-api"
      + sha                          = (known after apply)
    }

  # module.backend_api.github_repository_file.readme will be created
  + resource "github_repository_file" "readme" {
      + autocreate_branch_source_sha = (known after apply)
      + commit_author                = "Terraform"
      + commit_email                 = "terraform@example.com"
      + commit_message               = "Add README.md via Terraform"
      + commit_sha                   = (known after apply)
      + content                      = <<-EOT
            # 
            
            
            
            This repository is managed by Terraform.
            
            ## Getting Started
            
            This repository was created and configured using Terraform infrastructure as code.
            
            ## Repository Information
            
            - **Name**: 
            - **Description**: 
            - **URL**: 
            - **Created**: 
            
            ## Files
            
            This repository includes:
            - README.md (this file)
            - .gitignore (if configured)
            - Additional files as managed by Terraform
        EOT
      + file                         = "README.md"
      + id                           = (known after apply)
      + overwrite_on_create          = true
      + ref                          = (known after apply)
      + repository                   = "backend-api"
      + sha                          = (known after apply)
    }

  # module.data_pipeline.github_repository.repo will be created
  + resource "github_repository" "repo" {
      + allow_auto_merge            = false
      + allow_merge_commit          = true
      + allow_rebase_merge          = true
      + allow_squash_merge          = true
      + archived                    = false
      + auto_init                   = true
      + default_branch              = (known after apply)
      + delete_branch_on_merge      = false
      + description                 = "Data processing pipeline"
      + etag                        = (known after apply)
      + full_name                   = (known after apply)
      + git_clone_url               = (known after apply)
      + html_url                    = (known after apply)
      + http_clone_url              = (known after apply)
      + id                          = (known after apply)
      + merge_commit_message        = "PR_TITLE"
      + merge_commit_title          = "MERGE_MESSAGE"
      + name                        = "data-pipeline"
      + node_id                     = (known after apply)
      + primary_language            = (known after apply)
      + private                     = (known after apply)
      + repo_id                     = (known after apply)
      + squash_merge_commit_message = "COMMIT_MESSAGES"
      + squash_merge_commit_title   = "COMMIT_OR_PR_TITLE"
      + ssh_clone_url               = (known after apply)
      + svn_url                     = (known after apply)
      + topics                      = (known after apply)
      + visibility                  = "public"
      + web_commit_signoff_required = false

      + security_and_analysis (known after apply)
    }

  # module.data_pipeline.github_repository_file.gitignore will be created
  + resource "github_repository_file" "gitignore" {
      + autocreate_branch_source_sha = (known after apply)
      + commit_author                = "Terraform"
      + commit_email                 = "terraform@example.com"
      + commit_message               = "Add .gitignore via Terraform"
      + commit_sha                   = (known after apply)
      + content                      = <<-EOT
            # Terraform
            *.tfstate
            *.tfstate.*
            .terraform/
            .terraform.lock.hcl
            
            # IDE
            .vscode/
            .idea/
            *.swp
            *.swo
            
            # OS
            .DS_Store
            Thumbs.db
            
            # Logs
            *.log
            logs/
            
            # Dependencies
            node_modules/
            vendor/
            
            # Environment files
            .env
            .env.local
            .env.*.local
        EOT
      + file                         = ".gitignore"
      + id                           = (known after apply)
      + overwrite_on_create          = true
      + ref                          = (known after apply)
      + repository                   = "data-pipeline"
      + sha                          = (known after apply)
    }

  # module.data_pipeline.github_repository_file.readme will be created
  + resource "github_repository_file" "readme" {
      + autocreate_branch_source_sha = (known after apply)
      + commit_author                = "Terraform"
      + commit_email                 = "terraform@example.com"
      + commit_message               = "Add README.md via Terraform"
      + commit_sha                   = (known after apply)
      + content                      = <<-EOT
            # 
            
            
            
            This repository is managed by Terraform.
            
            ## Getting Started
            
            This repository was created and configured using Terraform infrastructure as code.
            
            ## Repository Information
            
            - **Name**: 
            - **Description**: 
            - **URL**: 
            - **Created**: 
            
            ## Files
            
            This repository includes:
            - README.md (this file)
            - .gitignore (if configured)
            - Additional files as managed by Terraform
        EOT
      + file                         = "README.md"
      + id                           = (known after apply)
      + overwrite_on_create          = true
      + ref                          = (known after apply)
      + repository                   = "data-pipeline"
      + sha                          = (known after apply)
    }

  # module.frontend_app.github_repository.repo will be created
  + resource "github_repository" "repo" {
      + allow_auto_merge            = false
      + allow_merge_commit          = true
      + allow_rebase_merge          = true
      + allow_squash_merge          = true
      + archived                    = false
      + auto_init                   = true
      + default_branch              = (known after apply)
      + delete_branch_on_merge      = false
      + description                 = "Frontend application repository"
      + etag                        = (known after apply)
      + full_name                   = (known after apply)
      + git_clone_url               = (known after apply)
      + html_url                    = (known after apply)
      + http_clone_url              = (known after apply)
      + id                          = (known after apply)
      + merge_commit_message        = "PR_TITLE"
      + merge_commit_title          = "MERGE_MESSAGE"
      + name                        = "frontend-app"
      + node_id                     = (known after apply)
      + primary_language            = (known after apply)
      + private                     = (known after apply)
      + repo_id                     = (known after apply)
      + squash_merge_commit_message = "COMMIT_MESSAGES"
      + squash_merge_commit_title   = "COMMIT_OR_PR_TITLE"
      + ssh_clone_url               = (known after apply)
      + svn_url                     = (known after apply)
      + topics                      = (known after apply)
      + visibility                  = "public"
      + web_commit_signoff_required = false

      + security_and_analysis (known after apply)
    }

  # module.frontend_app.github_repository_file.gitignore will be created
  + resource "github_repository_file" "gitignore" {
      + autocreate_branch_source_sha = (known after apply)
      + commit_author                = "Terraform"
      + commit_email                 = "terraform@example.com"
      + commit_message               = "Add .gitignore via Terraform"
      + commit_sha                   = (known after apply)
      + content                      = <<-EOT
            # Terraform
            *.tfstate
            *.tfstate.*
            .terraform/
            .terraform.lock.hcl
            
            # IDE
            .vscode/
            .idea/
            *.swp
            *.swo
            
            # OS
            .DS_Store
            Thumbs.db
            
            # Logs
            *.log
            logs/
            
            # Dependencies
            node_modules/
            vendor/
            
            # Environment files
            .env
            .env.local
            .env.*.local
        EOT
      + file                         = ".gitignore"
      + id                           = (known after apply)
      + overwrite_on_create          = true
      + ref                          = (known after apply)
      + repository                   = "frontend-app"
      + sha                          = (known after apply)
    }

  # module.frontend_app.github_repository_file.readme will be created
  + resource "github_repository_file" "readme" {
      + autocreate_branch_source_sha = (known after apply)
      + commit_author                = "Terraform"
      + commit_email                 = "terraform@example.com"
      + commit_message               = "Add README.md via Terraform"
      + commit_sha                   = (known after apply)
      + content                      = <<-EOT
            # 
            
            
            
            This repository is managed by Terraform.
            
            ## Getting Started
            
            This repository was created and configured using Terraform infrastructure as code.
            
            ## Repository Information
            
            - **Name**: 
            - **Description**: 
            - **URL**: 
            - **Created**: 
            
            ## Files
            
            This repository includes:
            - README.md (this file)
            - .gitignore (if configured)
            - Additional files as managed by Terraform
        EOT
      + file                         = "README.md"
      + id                           = (known after apply)
      + overwrite_on_create          = true
      + ref                          = (known after apply)
      + repository                   = "frontend-app"
      + sha                          = (known after apply)
    }

Plan: 9 to add, 0 to change, 0 to destroy.

```

</details>

*Pushed by: @joenathan7, Action: `pull_request`*